espressif/qemu/hw/ssi/esp32c3_spi2.c
/*
 * ESP32-C3 GPSPI2 (general-purpose SPI2) controller
 *
 * Copyright (c) 2026 Oroblanco Inc.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "sysemu/sysemu.h"
#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/registerfields.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "hw/ssi/ssi.h"
#include "hw/ssi/esp32c3_spi2.h"
#include "qemu/error-report.h"
#include "qemu/timer.h"

#define SPI2_DEBUG      0
#define SPI2_WARNING    1

static void esp32c3_spi2_update_irq(ESP32C3Spi2State *s)
{
    /*
     * For polling mode: DMA_INT_ST should reflect DMA_INT_RAW directly
     * so that software can poll for TRANS_DONE without enabling interrupts.
     * The actual IRQ only fires when the corresponding bit is also enabled
     * in DMA_INT_ENA.
     */
    s->dma_int_st = s->dma_int_raw;

    /* Only raise IRQ if corresponding bits are enabled */
    uint32_t irq_pending = s->dma_int_raw & s->dma_int_ena;
#if SPI2_DEBUG
    static uint32_t last_irq_state = 0;
    if (irq_pending != last_irq_state) {
        warn_report("[SPI2] IRQ: raw=0x%x ena=0x%x pending=0x%x -> %s",
                    s->dma_int_raw, s->dma_int_ena, irq_pending,
                    irq_pending ? "RAISE" : "LOWER");
        last_irq_state = irq_pending;
    }
#endif
    if (irq_pending) {
        qemu_irq_raise(s->irq);
    } else {
        qemu_irq_lower(s->irq);
    }
}

/* Virtual-time delay between a SPI_USR trigger and trans_done. Just needs to be
 * non-zero so completion is signalled from the timer callback (a clean async
 * context) rather than synchronously from inside the triggering MMIO write. */
#define ESP32C3_SPI2_COMPLETION_NS 1000

/* Timer callback: the transfer has "completed" — set TRANS_DONE and (if enabled)
 * raise the completion interrupt. Running here, rather than inline in the CMD.USR
 * write, ensures the IRQ latches into the CPU even for interrupt-driven transfers
 * whose trigger executes from within the guest's SPI ISR. */
static void esp32c3_spi2_completion_cb(void *opaque)
{
    ESP32C3Spi2State *s = opaque;
    s->dma_int_raw |= R_GPSPI2_DMA_INT_RAW_TRANS_DONE_MASK;
    esp32c3_spi2_update_irq(s);
}

/* Mark the just-triggered transfer as finished and schedule its async completion.
 * The data movement (SSI/GDMA) has already happened synchronously by this point. */
static void esp32c3_spi2_finish_transaction(ESP32C3Spi2State *s)
{
    s->cmd &= ~R_GPSPI2_CMD_USR_MASK;
    timer_mod(&s->completion_timer,
              qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + ESP32C3_SPI2_COMPLETION_NS);
}


static uint64_t esp32c3_spi2_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESP32C3Spi2State *s = ESP32C3_SPI2(opaque);

    uint64_t r = 0;
    switch (addr) {
        case A_GPSPI2_CMD:
            r = s->cmd;
            break;
        case A_GPSPI2_ADDR:
            r = s->addr;
            break;
        case A_GPSPI2_CTRL:
            r = s->ctrl;
            break;
        case A_GPSPI2_CLOCK:
            r = s->clock;
            break;
        case A_GPSPI2_USER:
            r = s->user;
            break;
        case A_GPSPI2_USER1:
            r = s->user1;
            break;
        case A_GPSPI2_USER2:
            r = s->user2;
            break;
        case A_GPSPI2_MS_DLEN:
            r = s->ms_dlen;
            break;
        case A_GPSPI2_MISC:
            r = s->misc;
            break;
        case A_GPSPI2_DMA_CONF:
            r = s->dma_conf;
            break;
        case A_GPSPI2_DMA_INT_ENA:
            r = s->dma_int_ena;
            break;
        case A_GPSPI2_DMA_INT_CLR:
            r = 0;
            break;
        case A_GPSPI2_DMA_INT_RAW:
            r = s->dma_int_raw;
            break;
        case A_GPSPI2_DMA_INT_ST:
            r = s->dma_int_st;
            break;
        case A_GPSPI2_W0 ... A_GPSPI2_W15:
            r = s->data_reg[(addr - A_GPSPI2_W0) / sizeof(uint32_t)];
#if SPI2_DEBUG
            info_report("[SPI2] READ W%lu = 0x%08lx",
                        (addr - A_GPSPI2_W0) / sizeof(uint32_t), r);
#endif
            break;
        /* QEMU extension: additional W registers for large CPU-mode transfers */
        case GPSPI2_W_EXT_BASE ... (GPSPI2_W_EXT_END - 1): {
            uint32_t idx = 16 + (addr - GPSPI2_W_EXT_BASE) / sizeof(uint32_t);
            if (idx < ESP32C3_SPI2_BUF_WORDS) {
                r = s->data_reg[idx];
            }
            break;
        }
        case A_GPSPI2_SLAVE:
            r = s->slave;
            break;
        case A_GPSPI2_CLK_GATE:
            r = s->clk_gate;
            break;
        case A_GPSPI2_DATE:
            r = s->date;
            break;
        case 0x24: /* SPI_DIN_MODE_REG */
        case 0x28: /* SPI_DIN_NUM_REG */
        case 0x2C: /* SPI_DOUT_MODE_REG */
        case 0x44: /* Additional registers after DMA_INT_ST */
        case 0x48:
        case 0x4C:
        case 0x50:
        case 0x54:
        case 0x58:
        case 0x5C:
        case 0x60:
        case 0x64:
        case 0x68:
        case 0x6C:
        case 0x70:
        case 0x74:
        case 0x78:
        case 0x7C:
        case 0x80:
        case 0x84:
        case 0x88:
        case 0x8C:
        case 0x90:
        case 0x94:
        case 0xD8: /* After W15 */
        case 0xDC:
        case 0xE4: /* SPI_SLAVE1_REG */
            r = 0;
            break;
        default:
#if SPI2_DEBUG
            warn_report("[SPI2] Unsupported read from 0x%lx", addr);
#endif
            break;
    }

#if SPI2_DEBUG
    if (addr == A_GPSPI2_CMD || addr == A_GPSPI2_DMA_INT_ST || addr == A_GPSPI2_DMA_INT_RAW) {
        info_report("[SPI2] READ 0x%lx = 0x%08lx", addr, r);
    }
#endif

    return r;
}


/**
 * @brief Perform a user-mode SPI transaction on GPSPI2.
 *
 * This is triggered when bit 24 (SPI_USR) is set in the CMD register.
 * The transaction phases (command, address, dummy, MOSI, MISO) are controlled
 * by the USER register bits.
 */
static void esp32c3_spi2_begin_transaction(ESP32C3Spi2State *s)
{
    uint8_t *buf = (uint8_t *)s->data_reg;

    /* Determine which CS line to assert. Default to CS0. */
    int cs_line = 0;

