espressif/qemu/hw/ssi/esp32c3_spi2.c
    /* Check if this CS line is disabled (software-controlled via GPIO).
     * When CSx_DIS is set, the hardware CS is disabled and we shouldn't
     * toggle it. The actual CS is controlled via GPIO separately.
     * However, for QEMU SD card emulation, we need to keep CS asserted
     * during the transaction. */
    uint32_t cs_dis_mask = 1 << cs_line;  /* CS0_DIS=bit0, CS1_DIS=bit1, CS2_DIS=bit2 */
    bool cs_disabled = (s->misc & cs_dis_mask) != 0;

    /* Assert CS low - but only if not already low.
     * Avoid spurious CS edges which would reset the SSI peripheral state. */
    if (s->cs_state[cs_line] != 0) {
#if SPI2_DEBUG
        info_report("[SPI2] CS%d -> LOW (misc=0x%08x, cs_disabled=%d, cs_keep_active=%d)",
                    cs_line, s->misc, cs_disabled,
                    !!(s->misc & R_GPSPI2_MISC_CS_KEEP_ACTIVE_MASK));
#endif
        qemu_set_irq(s->cs_gpio[cs_line], 0);
        s->cs_state[cs_line] = 0;
    }

    /* Command phase */
    if (s->user & R_GPSPI2_USER_USR_COMMAND_MASK) {
        uint32_t cmd_bitlen = FIELD_EX32(s->user2, GPSPI2_USER2, USR_COMMAND_BITLEN);
        uint32_t cmd_bytes = (cmd_bitlen + 1) / 8;
        uint32_t cmd_value = FIELD_EX32(s->user2, GPSPI2_USER2, USR_COMMAND_VALUE);

#if SPI2_DEBUG
        info_report("[SPI2] TX CMD: val=0x%x bytes=%u", cmd_value, cmd_bytes);
#endif
        /* Send command bytes, MSB first */
        for (int i = cmd_bytes - 1; i >= 0; i--) {
            ssi_transfer(s->spi, (cmd_value >> (i * 8)) & 0xFF);
        }
    }

    /* Address phase */
    if (s->user & R_GPSPI2_USER_USR_ADDR_MASK) {
        uint32_t addr_bitlen = FIELD_EX32(s->user1, GPSPI2_USER1, USR_ADDR_BITLEN);
        uint32_t addr_bytes = (addr_bitlen + 1) / 8;

        /* SPI expects address MSB first; byte-swap from little-endian storage */
        uint32_t addr_be = bswap32(s->addr);

        /* Shift so that the relevant bytes are at the beginning */
        if (addr_bytes > 0 && addr_bytes <= 4) {
            addr_be = addr_be >> (32 - addr_bytes * 8);
        }

#if SPI2_DEBUG
        info_report("[SPI2] TX ADDR: 0x%x bytes=%u", s->addr, addr_bytes);
#endif
        uint8_t *addr_ptr = (uint8_t *)&addr_be;
        for (uint32_t i = 0; i < addr_bytes; i++) {
            ssi_transfer(s->spi, addr_ptr[i]);
        }
    }

    /* Dummy phase */
    if (s->user & R_GPSPI2_USER_USR_DUMMY_MASK) {
        uint32_t dummy_cyclelen = FIELD_EX32(s->user1, GPSPI2_USER1, USR_DUMMY_CYCLELEN);
        /* dummy_cyclelen is (cycles - 1), so actual cycles = dummy_cyclelen + 1.
         * Each cycle is one bit on the SPI bus, so convert to bytes rounding up. */
        uint32_t dummy_bytes = (dummy_cyclelen + 1 + 7) / 8;
#if SPI2_DEBUG
        info_report("[SPI2] DUMMY: %u bytes", dummy_bytes);
#endif
        for (uint32_t i = 0; i < dummy_bytes; i++) {
            ssi_transfer(s->spi, 0x00);
        }
    }

    /* Data phase: MS_DLEN contains (bit_count - 1) in bits 17:0 */
    uint32_t data_bitlen = FIELD_EX32(s->ms_dlen, GPSPI2_MS_DLEN, MS_DATA_BITLEN);
    uint32_t data_len = (data_bitlen + 1) / 8;

    /* Clamp to the size of our data register buffer.
     * For QEMU, buffer is larger than real hardware to support SD card reads */
    if (data_len > ESP32C3_SPI2_BUF_WORDS * 4) {
        warn_report("[SPI2] Transaction %u bytes exceeds buffer %u bytes, clamping",
                    data_len, ESP32C3_SPI2_BUF_WORDS * 4);
        data_len = ESP32C3_SPI2_BUF_WORDS * 4;
    }

    bool do_mosi = (s->user & R_GPSPI2_USER_USR_MOSI_MASK) != 0;
    bool do_miso = (s->user & R_GPSPI2_USER_USR_MISO_MASK) != 0;

#if SPI2_DEBUG
    info_report("[SPI2] DATA: len=%u mosi=%d miso=%d user=0x%08x ms_dlen=0x%x",
                data_len, do_mosi, do_miso, s->user, s->ms_dlen);
#endif

    if (do_mosi && do_miso) {
        /* Full-duplex: send from data_reg and receive into data_reg simultaneously */
        for (uint32_t i = 0; i < data_len; i++) {
            uint8_t tx = buf[i];
            uint32_t res = ssi_transfer(s->spi, tx);
            buf[i] = (uint8_t)res;
#if SPI2_DEBUG
            if (i < 20) info_report("[SPI2]   FD[%u]: tx=0x%02x rx=0x%02x", i, tx, res & 0xff);
#endif
        }
    } else if (do_mosi) {
        /* TX only: send bytes from data_reg */
        for (uint32_t i = 0; i < data_len; i++) {
            ssi_transfer(s->spi, buf[i]);
        }
#if SPI2_DEBUG
        info_report("[SPI2]   TX: first bytes: %02x %02x %02x %02x",
                    data_len > 0 ? buf[0] : 0, data_len > 1 ? buf[1] : 0,
                    data_len > 2 ? buf[2] : 0, data_len > 3 ? buf[3] : 0);
#endif
    } else if (do_miso) {
        /* RX only: receive bytes into data_reg (send 0xFF dummy bytes) */
        for (uint32_t i = 0; i < data_len; i++) {
            uint32_t res = ssi_transfer(s->spi, 0xFF);
            buf[i] = (uint8_t)res;
        }
#if SPI2_DEBUG
        info_report("[SPI2]   RX: first bytes: %02x %02x %02x %02x",
                    data_len > 0 ? buf[0] : 0, data_len > 1 ? buf[1] : 0,
                    data_len > 2 ? buf[2] : 0, data_len > 3 ? buf[3] : 0);
#endif
    }

    /* Deassert CS high, unless:
     * 1. CS_KEEP_ACTIVE is set in MISC register, OR
     * 2. CSx_DIS is set (software-controlled CS via GPIO).
     *
     * When CSx_DIS is set, the actual CS is controlled via GPIO, not the SPI
     * peripheral. For QEMU SD card emulation, we keep CS low because the
     * ESP-IDF SDSPI driver does multiple single-byte SPI transfers within
     * one "CS-asserted" session controlled via GPIO. The ssi-sd state machine
     * needs CS to stay low to properly accumulate command bytes across
     * multiple SPI transfers. */
    if (!(s->misc & R_GPSPI2_MISC_CS_KEEP_ACTIVE_MASK) && !cs_disabled) {
        if (s->cs_state[cs_line] != 1) {
#if SPI2_DEBUG
            info_report("[SPI2] CS%d -> HIGH (cs_keep_active=0, cs_disabled=0)", cs_line);
#endif
            qemu_set_irq(s->cs_gpio[cs_line], 1);
            s->cs_state[cs_line] = 1;
        }
    }
#if SPI2_DEBUG
    else {
        /* CS stays low, no need to log every time */
    }
#endif

