espressif/qemu/hw/ssi/esp32c3_spi2.c
    /* Finish the transaction: clear USR now, signal completion asynchronously. */
    esp32c3_spi2_finish_transaction(s);
}


/**
 * @brief Determine if DMA mode should be used for the transaction.
 *
 * DMA mode is used when:
 * 1. GDMA controller is available (linked by machine)
 * 2. A GDMA channel is configured for SPI2 (PERI_SEL = GDMA_SPI2)
 */
static bool esp32c3_spi2_use_dma_mode(ESP32C3Spi2State *s)
{
    /* No GDMA controller linked: must use the CPU (W-register) path. */
    if (s->gdma == NULL) {
        return false;
    }

    /* Use DMA for a transaction iff the SPI2 GDMA channel is actually *armed* for
     * this transfer (the driver called gdma_start(), so the channel's LINK has
     * START set). The dma_conf DMA_RX/TX_ENA bits alone are NOT a reliable
     * discriminator: the SD driver leaves them set on the DMA-capable bus but then
     * issues tiny SPI_TRANS_USE_RXDATA transfers (e.g. poll_busy's 1-byte card-ready
     * polls) that read their result from the W0 register, with no GDMA descriptor
     * armed. Routing those through the DMA path would deposit the received byte in
     * GDMA memory and leave W0 zero, so poll_busy would never see the card go ready
     * and would spin until timeout — tens of thousands of single-byte transfers per
     * command, saturating the core and starving the I2S ring (the audio stutter).
     * Gating on an armed GDMA transfer sends real data blocks through DMA and these
     * W-register polls through the CPU path, as on real hardware. */
    return FIELD_EX32(s->dma_conf, GPSPI2_DMA_CONF, DMA_RX_ENA) ||
           FIELD_EX32(s->dma_conf, GPSPI2_DMA_CONF, DMA_TX_ENA);
}


/**
 * @brief Perform a DMA-mode SPI transaction on GPSPI2.
 *
 * This reads TX data from GDMA OUT channel, sends via SPI bus,
 * receives data, and writes to GDMA IN channel.
 */
static void esp32c3_spi2_dma_transaction(ESP32C3Spi2State *s)
{
    uint32_t gdma_out_idx = 0;
    uint32_t gdma_in_idx = 0;

    /* Determine which CS line to assert. Default to CS0. */
    int cs_line = 0;
    uint32_t cs_dis_mask = 1 << cs_line;
    bool cs_disabled = (s->misc & cs_dis_mask) != 0;

    /* Get GDMA channels configured for SPI2 */
    bool have_out = esp_gdma_get_channel_periph(s->gdma, GDMA_SPI2, ESP_GDMA_OUT_IDX, &gdma_out_idx);
    bool have_in = esp_gdma_get_channel_periph(s->gdma, GDMA_SPI2, ESP_GDMA_IN_IDX, &gdma_in_idx);

    /* Get data length from MS_DLEN register */
    uint32_t data_bitlen = FIELD_EX32(s->ms_dlen, GPSPI2_MS_DLEN, MS_DATA_BITLEN);
    uint32_t data_len = (data_bitlen + 1) / 8;

#if SPI2_DEBUG
    info_report("[SPI2] DMA TRANSACTION: data_len=%u have_out=%d (idx=%u) have_in=%d (idx=%u) "
                "user=0x%08x ms_dlen=0x%x",
                data_len, have_out, gdma_out_idx, have_in, gdma_in_idx, s->user, s->ms_dlen);
#endif

    /* Assert CS low */
    if (s->cs_state[cs_line] != 0) {
#if SPI2_DEBUG
        info_report("[SPI2] DMA: CS%d -> LOW", cs_line);
#endif
        qemu_set_irq(s->cs_gpio[cs_line], 0);
        s->cs_state[cs_line] = 0;
    }

    /* Command phase */
    if (s->user & R_GPSPI2_USER_USR_COMMAND_MASK) {
        uint32_t cmd_bitlen = FIELD_EX32(s->user2, GPSPI2_USER2, USR_COMMAND_BITLEN);
        uint32_t cmd_bytes = (cmd_bitlen + 1) / 8;
        uint32_t cmd_value = FIELD_EX32(s->user2, GPSPI2_USER2, USR_COMMAND_VALUE);

#if SPI2_DEBUG
        info_report("[SPI2] DMA TX CMD: val=0x%x bytes=%u", cmd_value, cmd_bytes);
#endif
        for (int i = cmd_bytes - 1; i >= 0; i--) {
            ssi_transfer(s->spi, (cmd_value >> (i * 8)) & 0xFF);
        }
    }

    /* Address phase */
    if (s->user & R_GPSPI2_USER_USR_ADDR_MASK) {
        uint32_t addr_bitlen = FIELD_EX32(s->user1, GPSPI2_USER1, USR_ADDR_BITLEN);
        uint32_t addr_bytes = (addr_bitlen + 1) / 8;
        uint32_t addr_be = bswap32(s->addr);

        if (addr_bytes > 0 && addr_bytes <= 4) {
            addr_be = addr_be >> (32 - addr_bytes * 8);
        }

#if SPI2_DEBUG
        info_report("[SPI2] DMA TX ADDR: 0x%x bytes=%u", s->addr, addr_bytes);
#endif
        uint8_t *addr_ptr = (uint8_t *)&addr_be;
        for (uint32_t i = 0; i < addr_bytes; i++) {
            ssi_transfer(s->spi, addr_ptr[i]);
        }
    }

    /* Dummy phase */
    if (s->user & R_GPSPI2_USER_USR_DUMMY_MASK) {
        uint32_t dummy_cyclelen = FIELD_EX32(s->user1, GPSPI2_USER1, USR_DUMMY_CYCLELEN);
        uint32_t dummy_bytes = (dummy_cyclelen + 1 + 7) / 8;
#if SPI2_DEBUG
        info_report("[SPI2] DMA DUMMY: %u bytes", dummy_bytes);
#endif
        for (uint32_t i = 0; i < dummy_bytes; i++) {
            ssi_transfer(s->spi, 0x00);
        }
    }

    /* Data phase via DMA */
    if (data_len > 0) {
        bool do_mosi = (s->user & R_GPSPI2_USER_USR_MOSI_MASK) != 0;
        bool do_miso = (s->user & R_GPSPI2_USER_USR_MISO_MASK) != 0;

        /* Allocate buffer for transfer */
        uint8_t *buffer = g_malloc(data_len);
        if (buffer == NULL) {
            error_report("[SPI2] Failed to allocate DMA buffer of %u bytes", data_len);
            goto complete;
        }

        /* Read TX data from GDMA OUT channel */
        if (do_mosi && have_out) {
            if (!esp_gdma_read_channel(s->gdma, gdma_out_idx, buffer, data_len)) {
                warn_report("[SPI2] Error reading from GDMA OUT channel");
                memset(buffer, 0xFF, data_len);
            }
#if SPI2_DEBUG
            {
                char hex[3 * 32 + 1] = {0};
                uint32_t n = data_len < 32 ? data_len : 32;
                for (uint32_t k = 0; k < n; k++) {
                    snprintf(hex + 3 * k, 4, "%02x ", buffer[k]);
                }
                info_report("[SPI2] DMA TX: %u bytes: %s", data_len, hex);
            }
#endif
        } else {
            /* Fill with 0xFF for RX-only transfers */
            memset(buffer, 0xFF, data_len);
        }

        /* Perform SPI transfer */
        for (uint32_t i = 0; i < data_len; i++) {
            uint32_t rx_byte = ssi_transfer(s->spi, buffer[i]);
            buffer[i] = (uint8_t)rx_byte;
        }

        /* Write RX data to GDMA IN channel */
        if (do_miso && have_in) {
#if SPI2_DEBUG
            info_report("[SPI2] DMA RX: writing %u bytes to GDMA, first: %02x %02x %02x %02x",
                        data_len,
                        data_len > 0 ? buffer[0] : 0, data_len > 1 ? buffer[1] : 0,
                        data_len > 2 ? buffer[2] : 0, data_len > 3 ? buffer[3] : 0);
#endif
            if (!esp_gdma_write_channel(s->gdma, gdma_in_idx, buffer, data_len)) {
                warn_report("[SPI2] Error writing to GDMA IN channel");
            }
        }

