espressif/qemu/hw/ssi/esp32c3_spi2.c
        g_free(buffer);
    }

    /* Deassert CS high if appropriate */
    if (!(s->misc & R_GPSPI2_MISC_CS_KEEP_ACTIVE_MASK) && !cs_disabled) {
        if (s->cs_state[cs_line] != 1) {
#if SPI2_DEBUG
            info_report("[SPI2] DMA: CS%d -> HIGH", cs_line);
#endif
            qemu_set_irq(s->cs_gpio[cs_line], 1);
            s->cs_state[cs_line] = 1;
        }
    }

complete:
    /* Finish the transaction: clear USR now, signal completion asynchronously. */
    esp32c3_spi2_finish_transaction(s);
}


static void esp32c3_spi2_write(void *opaque, hwaddr addr,
                               uint64_t value, unsigned int size)
{
    ESP32C3Spi2State *s = ESP32C3_SPI2(opaque);
    uint32_t wvalue = (uint32_t)value;

    /* Debug all significant writes */
#if SPI2_DEBUG
    if (addr != A_GPSPI2_DMA_INT_ST) {  /* Skip read-only register */
        info_report("[SPI2] WRITE 0x%02lx = 0x%08x", addr, wvalue);
    }
#endif

    switch (addr) {
        case A_GPSPI2_CMD:
            s->cmd = wvalue;
            if (wvalue & R_GPSPI2_CMD_UPDATE_MASK) {
                /* SPI_UPDATE bit: accept and clear (no-op for emulation;
                 * real HW uses this to sync APB -> SPI clock domain) */
                s->cmd &= ~R_GPSPI2_CMD_UPDATE_MASK;
            }
            if (wvalue & R_GPSPI2_CMD_USR_MASK) {
#if SPI2_DEBUG
                info_report("[SPI2] TRIGGER: user=0x%08x user1=0x%08x user2=0x%08x "
                            "ms_dlen=0x%x addr=0x%x dma_conf=0x%x "
                            "W0=0x%08x W1=0x%08x W2=0x%08x W3=0x%08x",
                            s->user, s->user1, s->user2,
                            s->ms_dlen, s->addr, s->dma_conf,
                            s->data_reg[0], s->data_reg[1],
                            s->data_reg[2], s->data_reg[3]);
#endif
                /* Check if DMA mode should be used */
                if (esp32c3_spi2_use_dma_mode(s)) {
#if SPI2_DEBUG
                    info_report("[SPI2] -> DMA path (dma_conf=0x%x int_ena=0x%x)",
                                s->dma_conf, s->dma_int_ena);
#endif
                    esp32c3_spi2_dma_transaction(s);
                } else {
#if SPI2_DEBUG
                    info_report("[SPI2] -> CPU path (dma_conf=0x%x int_ena=0x%x)",
                                s->dma_conf, s->dma_int_ena);
#endif
                    esp32c3_spi2_begin_transaction(s);
                }
            }
            break;
        case A_GPSPI2_ADDR:
            s->addr = wvalue;
            break;
        case A_GPSPI2_CTRL:
            s->ctrl = wvalue;
            break;
        case A_GPSPI2_CLOCK:
            s->clock = wvalue;
            break;
        case A_GPSPI2_USER:
            s->user = wvalue;
            break;
        case A_GPSPI2_USER1:
            s->user1 = wvalue;
            break;
        case A_GPSPI2_USER2:
            s->user2 = wvalue;
            break;
        case A_GPSPI2_MS_DLEN:
            s->ms_dlen = wvalue;
            break;
        case A_GPSPI2_MISC:
            s->misc = wvalue;
            break;
        case A_GPSPI2_DMA_CONF:
            /* Store DMA config; the AFIFO reset bits are write-1-pulse, so mask them
             * out of the retained value. The DMA_RX_ENA/DMA_TX_ENA bits are kept and
             * drive esp32c3_spi2_use_dma_mode(). */
            s->dma_conf = wvalue & ~(R_GPSPI2_DMA_CONF_RX_AFIFO_RST_MASK |
                                     R_GPSPI2_DMA_CONF_BUF_AFIFO_RST_MASK |
                                     R_GPSPI2_DMA_CONF_DMA_AFIFO_RST_MASK);
            break;
        case A_GPSPI2_DMA_INT_ENA:
            s->dma_int_ena = wvalue;
            esp32c3_spi2_update_irq(s);
            break;
        case A_GPSPI2_DMA_INT_CLR:
            /* Writing 1 to a bit clears the corresponding bit in DMA_INT_RAW */
            s->dma_int_raw &= ~wvalue;
            esp32c3_spi2_update_irq(s);
            break;
        case A_GPSPI2_DMA_INT_RAW:
            /* RAW register is typically not written by software, but accept writes */
            s->dma_int_raw = wvalue;
            esp32c3_spi2_update_irq(s);
            break;
        case A_GPSPI2_W0 ... A_GPSPI2_W15:
            s->data_reg[(addr - A_GPSPI2_W0) / sizeof(uint32_t)] = wvalue;
            break;
        /* QEMU extension: additional W registers for large CPU-mode transfers */
        case GPSPI2_W_EXT_BASE ... (GPSPI2_W_EXT_END - 1): {
            uint32_t idx = 16 + (addr - GPSPI2_W_EXT_BASE) / sizeof(uint32_t);
            if (idx < ESP32C3_SPI2_BUF_WORDS) {
                s->data_reg[idx] = wvalue;
            }
            break;
        }
        case A_GPSPI2_SLAVE:
            s->slave = wvalue;
            break;
        case A_GPSPI2_CLK_GATE:
            s->clk_gate = wvalue;
            break;
        case A_GPSPI2_DATE:
            s->date = wvalue;
            break;
        case A_GPSPI2_DMA_INT_ST:
            /* DMA_INT_ST is read-only (computed from RAW & ENA) - ignore writes */
            break;
        case 0x24: /* SPI_DIN_MODE_REG */
        case 0x28: /* SPI_DIN_NUM_REG */
        case 0x2C: /* SPI_DOUT_MODE_REG */
        case 0x44: /* Additional registers */
        case 0x48:
        case 0x4C:
        case 0x50:
        case 0x54:
        case 0x58:
        case 0x5C:
        case 0x60:
        case 0x64:
        case 0x68:
        case 0x6C:
        case 0x70:
        case 0x74:
        case 0x78:
        case 0x7C:
        case 0x80:
        case 0x84:
        case 0x88:
        case 0x8C:
        case 0x90:
        case 0x94:
        case 0xD8:
        case 0xDC:
        case 0xE4: /* SPI_SLAVE1_REG */
            /* Accept but ignore timing/mode/other registers */
            break;
        default:
#if SPI2_DEBUG
            warn_report("[SPI2] Unsupported write to 0x%lx (%08lx)", addr, value);
#endif
            break;
    }
}


static const MemoryRegionOps esp32c3_spi2_ops = {
    .read = esp32c3_spi2_read,
    .write = esp32c3_spi2_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


static void esp32c3_spi2_reset_hold(Object *obj, ResetType type)
{
    ESP32C3Spi2State *s = ESP32C3_SPI2(obj);

