espressif/qemu/hw/ssi/esp32c3_spi2.c
    s->cmd = 0;
    s->addr = 0;
    s->ctrl = 0;
    s->clock = 0;
    s->user = 0;
    s->user1 = 0;
    s->user2 = 0;
    s->ms_dlen = 0;
    s->misc = 0;
    s->dma_conf = 0;
    s->dma_int_ena = 0;
    s->dma_int_clr = 0;
    s->dma_int_raw = 0;
    s->dma_int_st = 0;
    s->slave = 0;
    s->clk_gate = 0;
    s->date = 0;
    memset(s->data_reg, 0, ESP32C3_SPI2_BUF_WORDS * sizeof(uint32_t));
    /* CS starts high (deasserted) */
    for (int i = 0; i < ESP32C3_SPI2_CS_COUNT; i++) {
        s->cs_state[i] = 1;
    }
}


static void esp32c3_spi2_realize(DeviceState *dev, Error **errp)
{
    ESP32C3Spi2State *s = ESP32C3_SPI2(dev);

    /* GDMA is optional - if not set, only CPU mode will work */
    if (s->gdma == NULL) {
        info_report("[SPI2] GDMA not configured, DMA mode disabled");
    }
}


static void esp32c3_spi2_init(Object *obj)
{
    ESP32C3Spi2State *s = ESP32C3_SPI2(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32c3_spi2_ops, s,
                          TYPE_ESP32C3_SPI2, ESP32C3_SPI2_IO_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);
    sysbus_init_irq(sbd, &s->irq);

    timer_init_ns(&s->completion_timer, QEMU_CLOCK_VIRTUAL,
                  esp32c3_spi2_completion_cb, s);

    esp32c3_spi2_reset_hold(obj, RESET_TYPE_COLD);

    s->spi = ssi_create_bus(DEVICE(s), "spi");
    qdev_init_gpio_out_named(DEVICE(s), s->cs_gpio, SSI_GPIO_CS,
                             ESP32C3_SPI2_CS_COUNT);
}


static Property esp32c3_spi2_properties[] = {
    DEFINE_PROP_END_OF_LIST(),
};


static void esp32c3_spi2_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    rc->phases.hold = esp32c3_spi2_reset_hold;
    dc->realize = esp32c3_spi2_realize;
    device_class_set_props(dc, esp32c3_spi2_properties);
}


static const TypeInfo esp32c3_spi2_info = {
    .name = TYPE_ESP32C3_SPI2,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(ESP32C3Spi2State),
    .instance_init = esp32c3_spi2_init,
    .class_init = esp32c3_spi2_class_init,
};


static void esp32c3_spi2_register_types(void)
{
    type_register_static(&esp32c3_spi2_info);
}

type_init(esp32c3_spi2_register_types)
